import React, { useState } from 'react'
import Navbar from '../components/Navbar'
import Footer from '../components/Footer'

const Allergies = () => {
    const [loading, setLoading] = useState(true);
    setTimeout(() => {
        setLoading(false);
    }, 3000);
    return (
        <>
            <div>
                <Navbar />
            </div>
            <div className='container '>
                <div style={{ backgroundColor: '#dcebd7', color: 'green', height: 'auto' }} className='p-3 py-4 rounded-4 shadow  my-5 rounded-4 container'>
                    <div className="text-center">
                        {
                            loading ?
                                (
                                    <>
                                        <div class="spinner-border" role="status">
                                            <span class="visually-hidden">Loading...</span>
                                        </div>
                                        <div className="">
                                            Please wait...
                                        </div>
                                    </>
                                ) : (
                                    <iframe width="100%" height="300px" className='rounded-4' src="https://www.youtube.com/embed/1PO1IbW9ojY" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" allowfullscreen></iframe>

                                )
                        }
                    </div>

                    <div className='mt-2'>
                        <p>एलर्जी शरीर की उस पदार्थ या उत्पाद के प्रति प्रतिक्रिया है जिसे वह एक हानिकारक "आक्रमणकारी" के रूप में देखता है। उदाहरण के लिए, पराग (pollen),  धूल के कण और कोई जानवर यह सभी वह चीज़े हैं जिससे हमें कोई परेशानी नहीं होती। लेकिन कुछ लोगों के इन चीज़ों के संपर्क में आने से व्यक्ति कि प्रतिरक्षा प्रणाली प्रतिक्रिया कर सकती है, जिसकी वजह से कोई शारीरिक समस्या होना शुरू हो जाती है, जैसे – धूल के कणों के संपर्क में आने से छींक आना। पदार्थ जो इन प्रतिक्रियाओं का कारण बनते हैं उन्हें एलर्जी कहा जाता है। एलर्जी अनुवांशिक भी हो सकती है, लेकिन यह व्यक्ति से दुसरे व्यक्ति से नहीं जाती।
                        </p>
                        <h4>एलर्जी के प्रकार</h4>
                        <ul>
                            <li>
                                वेदर एलर्जी - अधिकतर लोगों को बदलते मौसम के कारण स्वास्थ्य समस्याएं होने लगती हैं जो मौसमी एलर्जी के लक्षण होते हैं।
                            </li>
                            <li>
                                डस्ट एलर्जी - जब धूल में मौजूद सूक्ष्म कण आपकी नाक में चले जाते हैं, तो एलर्जी के नाक के मार्ग रुकने लगते हैं। इससे नाक रुकना, छींक आना, खांसी और गले में खुजली व जलन होना आदि समस्याएं होने लगती है।
                            </li>
                            <li>
                                मेडिसिन एलर्जी - किसी दवा या उसके कारण शरीर में बने केमिकल से भी कुछ लोगों को एलर्जी हो सकती है। दवाओं से होने वाली एलर्जी कई बार अत्यधिक गंभीर व जानलेवा हो सकती है
                            </li>
                            <li>
                                डस्ट एलर्जी - जब धूल में मौजूद सूक्ष्म कण आपकी नाक में चले जाते हैं, तो एलर्जी के नाक के मार्ग रुकने लगते हैं। इससे नाक रुकना, छींक आना, खांसी और गले में खुजली व जलन होना आदि समस्याएं होने लगती है।
                            </li>
                            <li>
                                फूड एलर्जी - जब आपके द्वारा खाए गए भोजन में मौजूद प्रोटीन से आपकी प्रतिरक्षा प्रणाली प्रतिक्रिया देने लगती है, जो एलर्जी के लक्षण पैदा होने लगती हैं। भारत में फूड एलर्जी के 90 प्रतिशत मामलों में सूखे मेवे, अंडे, गेहूं और दूध के कारण एलर्जी होती है।
                            </li>
                        </ul>
                        <h4>एलर्जी होने पर क्या लक्षण दिखाई देते हैं?</h4>
                        <p>एलर्जी के लक्षण इस बात पर निर्भर करते हैं कि व्यक्ति को किस चीज़ से एलर्जी है और साथ ही वह कैसे उसके संपर्क में आया है। अगर व्यक्ति को संभावित पदार्थ खाने में दिया जाए तो उसे पेट और सांस से जुड़ी समस्याएँ हो सकती है। एलर्जी के लक्षण कितने देर तक दिखाई देते हैं यह भी इस बात पर निर्भर करता हैं कि व्यक्ति संभावित पदार्थ से कितने देर तक संपर्क में रहा है और साथ ही उसकी मात्रा कितनी थी। उदाहरण के लिए, अगर किसी व्यक्ति को अखरोट से एलर्जी है और वह कुछ मात्रा में अखरोट ले लेता है तो उसे ज्यादा गंभीर लक्षण नहीं दिखाई देंगे। वहीं अगर ज्यादा मात्रा में अखरोट लिए तो व्यक्ति को काफी गंभीर लक्षण दिखाई दे सकते हैं और हो सकता है कि बात जान जाने तक भी आ सकती है। </p>
                        <h4>एलर्जी की रोकथाम</h4>
                        <p>एलर्जी पैदा करने वाले पदार्थों (एलर्जन) के संपर्क में आने से जितना हो सके बचना ही एलर्जी की रोकथाम करने का सबसे अच्छा तरीका है। ऐसा करने के लिए निम्न टिप्स को फॉलो किया जा सकता है</p>
                        <ul>
                            <li>अगर आपको फूड एलर्जी है, तो बाहर की कोई भी चीज खाने से पहले यह सुनिश्चित कर लें कि उसमें कोई ऐसी सामग्री तो नहीं डाली गई है, जिससे आपको एलर्जी है।</li>
                            <li>
                                यदि आपको मक्खियों के डंक से एलर्जी है, तो जितना हो सके परफ्यूम व चमकदार कपड़े न पहने। बागवानी व घास की कटाई आदि करते समय भी ध्यान रखें।
                            </li>
                            <li>
                                यदि आपको पराग (पोलन) से एलर्जी है, तो पोलन सीजन के दौरान जितना हो सके घर के अंदर ही रहें और खिड़कियां व दरवाजे बंद रखें।
                            </li>
                        </ul>
                        <h4>रोकथाम के सुझाव</h4>
                        <h5 className='py-2'>संपर्क में आने से बचें</h5>
                        <ul>
                            <li>ऐसे ऐलर्जेन के संपर्क में आने से बचें जिससे आप को एलर्जी है। यह भोजन और दवा संबंधी एलर्जी के लिए आसान है। अच्छी तरह से सभी भोजन और दवा के लेबल पढ़ें ताकि उस सामग्री से बचा जा सके जो एलर्जी की प्रतिक्रिया का कारण बन सकते हैं
                            </li>
                        </ul>
                        <h5>अपने घर को साफ रखें</h5>
                        <ul>
                            <li>धूल और पराग की वजह से होने वाली एलर्जी के लिए,ऐलर्जेन के संपर्क में आने से बचने के लिए जोखिम को कम करने में मदद करने का सबसे अच्छा तरीका अच्छी तरह से मुलायम सतहों (जैसे कालीन, असबाबवाला फर्नीचर और तकिए) के फर्श को साफ करना और धूल-कठोर सतहों को एक नम कपड़े द्वारा साफ करें।</li>
                            <li className='py-2'>पानी में डेटॉल एंटीसेप्टिक तरल की कुछ बूंदें डालकर सतहों को साफ कर लें। यह 99.9% कीटाणुओं को मार देगा।</li>
                        </ul>
                        <h5>दवा और एंटीथिस्टेमाइंस</h5>
                        <ul>
                            <li>
                                एंटीथिस्टेमाइंस जैसी दवाएं एलर्जी के प्रभाव को घटाती और कम करती हैं विशेष रूप से वायुजनित ऐलर्जेन (जैसे कि हे फीवर के रूप में) के लिए उपयोगी हो सकती है क्योंकि वह हमारे आसपास के माहौल में होते हैं। रक्ताधिक्यहारी और नाक स्प्रे आम वायुजनित/सांस की एलर्जी की वजह से होने वाले लक्षणों में से कुछ को संभाल सकते हैं।
                            </li>
                        </ul>
                    </div>

                </div>
            </div>
            <div className='footer'>
                <Footer />
            </div>
        </>
    )
}

export default Allergies
