import React, { useState } from 'react'
import Navbar from '../components/Navbar'
import Footer from '../components/Footer'

const HairLoss = () => {
    const [loading, setLoading] = useState(true);
    setTimeout(() => {
        setLoading(false)
    }, 3000);
    return (
        <div>
            <div>
                <div>
                    <Navbar />
                </div>
                <div className='my-5 text-light rounded-4 container'>
                    <div style={{ backgroundColor: '#dcebd7', color: 'green', height: 'auto' }} className='p-3 py-4 rounded-4 shadow  my-5 rounded-4 container'>
                        <div className="text-center">
                            {
                                loading ? (
                                    <>
                                        <div class="spinner-border" role="status">
                                            <span class="visually-hidden">Loading...</span>
                                        </div>
                                        <div className="">
                                            Please wait...
                                        </div>
                                    </>
                                ) : (
                                    <iframe width="100%" height="300px" className='rounded-3' src="https://www.youtube.com/embed/PSUH4-cNUio" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" allowfullscreen></iframe>
                                )
                            }
                        </div>
                        <p>
                            बालों का झड़ना (Hair Fall problem) एक आम समस्या बन गई है। इसका जल्द से जल्द इलाज करना बहुत जरूरी होता है। आजकल लोगों की जीवनशैली और खान-पान इतनी बुरी हो गई है कि इसका सीधा असर बालों पर पड़ता है। ऊपर से प्रदूषण और हेयर प्रोडक्ट के केमिकल के कारण भी बालों पर असर पड़ता है, जो बाद में बालों के झड़ने का कारण बन जाता है।
                        </p>
                        <h6>बाल झड़ने के कारण</h6>
                        <ul>
                            <li>
                                हार्मोन स्तर में आकस्मिक बदलाव के बाद भी ये हो सकता है, विशेषकर स्त्रियों में शिशु को जन्म देने के बाद यह होता है।
                            </li>
                            <li>
                                किसी बीमारी के लक्षण के रूप में भी बालों का झड़ना हो सकता है जैसे कि थायरॉयड, सेक्स हार्मोन में असंतुलन या गंभीर पोषाहार समस्या विशेषकर प्रोटीन, जिंक, बायोटीन की कमी। यह कमी खान-पान में परहेज करने वाले और महिलाओं में मासिक धर्म में बहुत ज्यादा रक्तस्राव होने पर होता है
                            </li>
                            <li>
                                सिर की त्वचा में फफूंद से संक्रमण हो जाता है तो बीच-बीच में बाल झड़ते है।
                            </li>
                            <li>
                                लंबी बीमारी या किसी बड़ी शल्य क्रिया या सर्जरी, गंभीर संक्रमण या इंफेक्शन और शारीरिक तनाव से दो या तीन महीने के बाद बालों का झड़ना एक सामान्य प्रक्रिया है।
                            </li>
                        </ul>
                        <h6>
                            बालों का झड़ना रोकने के घरेलू उपाय
                        </h6>
                        <ul>
                            <li>
                                प्याज का रस
                                <p>
                                    अपने सिर में लहसुन का रस, प्याज का रस या अदरक का रस लगाकर मसाज करें। इस प्रक्रिया को सोने से पहले करे तथा सुबह अच्छी तरह से बालों को धो लें। प्याज के रस में सल्फर की मात्रा होती है, ये टिशु में मौजूद कोलाजेन के उत्पादन को बढ़ावा देते है। बाल झड़ने की दवा के रूप में प्याज का प्रयोग बालों का झड़ना रोकता (balo ko jhadne se rokne ke upay) है।
                                </p>
                            </li>
                            <li>
                                तेल से मसाज
                                <ol>
                                    <li>
                                        कोई भी प्राकृतिक तैल जैसे, ऑलिव ऑयल, नारियल का तेल या कनोला ऑयल लें। इसको हल्का गर्म करके इस तैल से अपने स्कैल्प में रोज मसाज करें। मसाज के बाद सिर पर एक शॉवर कैप पहन लें और इसे करीब एक घंटे बाद शैंपू से धो लें। बालों को झड़ने से रोकने के उपाय के रूप में तेल से इलाज (hair fall control) करना बहुत ही फायदा पहुंचाता है।
                                    </li>
                                    <li>
                                        बालों को झड़ने से रोकने में बादाम का तेल भी बहुत ही उपयोगी है। विशेषज्ञों के अनुसार अगर आपके बाल रूखे और बेजान होने के कारण झड़ रहे हैं तो बादाम के तेल से सिर की मसाज करें। इससे बालों का रूखापन दूर होता है और बालों का झड़ना कम होता है।
                                    </li>
                                </ol>
                            </li>
                            <li>
                                ग्रीन टी
                                <p>
                                    ग्रीन टी को बाल झड़ने की दवा के रूप में इस्तेमाल किया जा सकता है। ग्रीन टी को एक कप पानी में मिलाकर अपने सिर में लगा लें और इसे करीब एक घंटे तक छोड़ दें। ग्रीन टी में एन्टीऑक्सिडेंट होता है जो बालों झड़ने से रोकने में मदद करते हैं। ग्रीन टी पीकर नहीं इसका इस्तेमाल करके बालों का झड़ना (balo ko jhadne se rokne ke upay) रोक सकते हैं। बालों को झड़ने से रोकने में ग्रीन टी का इलाज बहुत असरदार तरीके से काम करता है।
                                </p>
                            </li>
                        </ul>
                    </div>
                </div>
            </div>
            <div className="footer">
                <Footer />
            </div>
        </div>
    )
}

export default HairLoss
